#### RebarHandlePositionData Members

---

|  |
| --- |
| RebarHandlePositionData Class   Methods   Properties   See Also |

The  RebarHandlePositionData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarHandlePositionData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBarGeometry | Returns the geometry for a bar at the specified index currently in the Rebar. |
| Public method | GetDistributionPath | Gets the distribution path currently stored in the rebar. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetNumberOfBars | Gets the number of bars currently in the rebar. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetPosition | Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarHandlePositionData Class

Autodesk.Revit.DB.Structure Namespace